import random

list1 = []
list_index = []
n = int(input("Enter quantity of numbers in random list: "))

for item in range (n):
    list1.append(random.randint(-3, 3))
print ("List1: ", list1)

for item in list1:
    list_index.append(list1.index(item))
print ("List_index: ", list_index)

for item in range (n-1, -1, -1):
    if list1[item] < 0:
        list1.remove(list1[item])
        print(list1)
print ("List_change: ", list1)

#якщо числа повторяються, то індекси теж повторяються; при цьому, видаляє елемент по цьому індексу спочатку, а не з кінця.
#пробігаючи в зворотньому напрямку, не відбувається зсуву при видаленні
"""
Enter quantity of numbers in random list: 20
List1:  [-1, 1, -2, -1, -1, 1, -1, -3, 3, 0, 0, -2, -2, -2, 0, 0, -1, -3, 3, 2]
List_index:  [0, 1, 2, 0, 0, 1, 0, 7, 8, 9, 9, 2, 2, 2, 9, 9, 0, 7, 8, 19]
[-1, 1, -2, -1, -1, 1, -1, 3, 0, 0, -2, -2, -2, 0, 0, -1, -3, 3, 2]
[-1, 1, -2, -1, -1, 1, -1, 3, 0, 0, -2, -2, -2, 0, 0, -1, 3, 2]
[1, -2, -1, -1, 1, -1, 3, 0, 0, -2, -2, -2, 0, 0, -1, 3, 2]
[1, -2, -1, 1, -1, 3, 0, 0, -2, -2, -2, 0, 0, -1, 3, 2]
[1, -2, 1, -1, 3, 0, 0, -2, -2, -2, 0, 0, -1, 3, 2]
[1, -2, 1, 3, 0, 0, -2, -2, -2, 0, 0, -1, 3, 2]
[1, -2, 1, 3, 0, 0, -2, -2, -2, 0, 0, 3, 2]
[1, 1, 3, 0, 0, -2, -2, -2, 0, 0, 3, 2]
[1, 1, 3, 0, 0, -2, -2, 0, 0, 3, 2]
[1, 1, 3, 0, 0, -2, 0, 0, 3, 2]
[1, 1, 3, 0, 0, 0, 0, 3, 2]
List_change:  [1, 1, 3, 0, 0, 0, 0, 3, 2]
"""
